global schedule_hesh
schedule_hesh = {
        'понедельник':{
            '1/1':'ОАиП',
            '1/2':'ОАиП',
            '2/1':'ИПО',
            '2/2':'ИПО',
            '3/1':'Математика',
            '3/2':'Математика',
            '4/1':'ФК',
            '4/1':'ФК',
        },
        'вторник':{
            '1/1':'ОАиП',
            '1/2':'ОАиП',
            '2/1':'АЛОВТ',
            '2/2':'АЛОВТ',
            '3/1':'ИПО',
            '3/2':'ИПО',
            '4/1':'---',
            '4/2':'---',
        },
        'среда':{
            '1/1':'Математика',
            '1/2':'Математика',
            '2/1':'ОИГ',
            '2/2':'ФК',
            '3/1':'ОДП',
            '3/2':'ОДП',
            '4/1':'ОТ',
            '4/2':'ОТ',
        },
        'четверг':{
            '1/1':'Ин.яз.',
            '1/2':'Ин.яз.',
            '2/1':'ОДП',
            '2/2':'ФК',
            '3/1':'ОИГ',
            '3/2':'ОИГ',
            '4/1':'Кураторский',
            '4/2':'Информационный',
        },
        'пятница':{
            '1/1':'АЛОВТ',
            '1/2':'АЛОВТ',
            '2/1':'ОАиП',
            '2/2':'ОАиП',
            '3/1':'Математика',
            '3/2':'Математика',
            '4/1':'---',
            '4/2':'---',
        },
        'суббота':{
            '1/1':'ОСНГ',
            '1/2':'ОСНГ',
            '2/1':'ОТ',
            '2/2':'ОТ',
            '3/1':'Ин.яз.',
            '3/2':'Ин.яз.',
            '4/1':'---',
            '4/2':'---',
        },
    }

def giveThisDay(day:str) -> str:
    return schedule_hesh[day]


# def giveThisDay(day:str) -> str:
#     out = ''
#     for i, j in schedule_hesh[day].items():
#         out += f'{i} ~ {j}\n'
#     return out[:len(out)-1]
