global schedule_hesh
schedule_hesh = {
        'Monday':{
            '1':'ОАиП',
            '2':'ИПО',
            '3':'Математика',
            '4/1':'ФК',
        },
        'Tuesday':{
            '1':'ОАиП',
            '2':'АЛОВТ',
            '3':'ИПО',
            '4':'---',
        },
        'Wednesday':{
            '1':'Математика',
            '2/1':'ОИГ',
            '2/2':'ФК',
            '3':'ОДП',
            '4':'ОТ',
        },
        'Thursday':{
            '1':'Англ.яз',
            '2/1':'ОДП',
            '2/2':'ФК',
            '3':'ОИГ',
            '4':'Кураторский',
        },
        'Friday':{
            '1':'АЛОВТ',
            '2':'ОАиП',
            '3':'Математика',
            '4':'---',
        },
        'Saturday':{
            '1':'ОСНГ',
            '2':'ОТ',
            '3':'Англ.яз',
            '4':'---',
        },
    }

def giveThisDay(day:str) -> str:
    out = ''
    for i, j in schedule_hesh[day].items():
        out += f'{i} ~ {j}\n'
    return out[:len(out)-1]
